Tesla-UFMG/ECU/ECU.ioc
#MicroXplorer Configuration settings - do not modify
PD7.Mode=Full_Duplex_Master
PCC.Series=STM32H7
FREERTOS.Queues01=q_speed_message,16,speed_message_t,0,Dynamic,NULL,NULL;q_torque_message,16,torque_message_t,0,Dynamic,NULL,NULL;q_ref_torque_message,16,ref_torque_t,0,Dynamic,NULL,NULL;q_datalog_message,128,datalog_message_t,0,Dynamic,NULL,NULL;q_debugleds_message,16,debugled_message_t,0,Dynamic,NULL,NULL
PD12.GPIO_Label=C_LED_BLUE
FDCAN2.DataPrescaler=1
SPI1.VirtualType=VM_MASTER
TIM1.IPParameters=Prescaler,Period
SH.GPXTI14.0=GPIO_EXTI14
FDCAN2.RxFifo0ElmtsNbr=0
RCC.PLLFRACN=6144
PD3.GPIOParameters=GPIO_Label
FDCAN1.RxBuffersNbr=0
RCC.RTCFreq_Value=32000
PA6.GPIO_Label=S_APPS1
PD4.Locked=true
RCC.CpuClockFreq_Value=75000000
SH.ADCx_INP5.0=ADC1_INP5,IN5-Single-Ended
PB13.Signal=FDCAN2_TX
PD6.GPIO_Label=B_MODO
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=C_LED_DEBUG3
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=75000000
SH.GPXTI13.0=GPIO_EXTI13
RCC.LPTIM1Freq_Value=37500000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
FREERTOS.configENABLE_FPU=1
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
SH.GPXTI3.ConfNb=1
PCC.PartNumber=STM32H743VITx
ADC1.Channel-5\#ChannelRegularConversion=ADC_CHANNEL_19
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.I2C4Freq_Value=75000000
TIM2.IPParameters=Prescaler,Period
PD4.Signal=GPXTI4
Dma.ADC1.0.Direction=DMA_PERIPH_TO_MEMORY
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_5
RCC.DIVQ3Freq_Value=16125000
SPI1.CalculateBaudRate=292.968 KBits/s
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
PE5.Signal=GPIO_Output
FREERTOS.configMINIMAL_STACK_SIZE=64
Dma.ADC1.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
SH.ADCx_INP4.0=ADC1_INP4,IN4-Single-Ended
PE14.Locked=true
NVIC.EXTI15_10_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PCC.Seq0.Step0.Voltage_Source=Battery
RCC.DIVM2=1
RCC.DIVM1=1
SH.GPXTI12.0=GPIO_EXTI12
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.21
PE15.Locked=true
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=75000000
PC4.GPIO_Label=S_VOLANTE
PB1.GPIO_Label=S_ADC_E2
Dma.ADC1.0.PeriphInc=DMA_PINC_DISABLE
FDCAN1.NominalPrescaler=1
RCC.USART16Freq_Value=75000000
PE4.GPIO_Label=C_LED_DEBUG1
PE5.PinState=GPIO_PIN_SET
PC9.Mode=I2C
FDCAN2.NominalSyncJumpWidth=2
FDCAN2.TxEventsNbr=0
PA8.Signal=I2C3_SCL
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
RCC.DIVR2Freq_Value=80000000
ProjectManager.HalAssertFull=false
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
VP_TIM1_VS_ClockSourceINT.Mode=Internal
RCC.DIVP2Freq_Value=40000000
SH.ADCx_INP3.0=ADC1_INP3,IN3-Single-Ended
PE6.PinState=GPIO_PIN_SET
FDCAN1.TxBuffersNbr=0
SH.ADCx_INP4.ConfNb=1
RCC.MCO2PinFreq_Value=75000000
ADC1.OffsetNumber-5\#ChannelRegularConversion=ADC_OFFSET_NONE
Mcu.Package=LQFP100
TIM2.Prescaler=0
PB1.Signal=ADCx_INP5
PA5.Locked=true
NVIC.TimeBase=TIM3_IRQn
RCC.PLL3FRACN=0
PD12.Signal=GPIO_Output
PD5.GPIOParameters=GPIO_Label
NVIC.TimeBaseIP=TIM3
PA10.Signal=LPUART1_RX
FREERTOS.FootprintOK=true
PE12.GPIO_Label=S_VEL1
RCC.DFSDMFreq_Value=75000000
PA5.GPIOParameters=GPIO_Label
SH.GPXTI14.ConfNb=1
RCC.TraceFreq_Value=75000000
RCC.APB4Freq_Value=75000000
FDCAN1.DataTimeSeg2=3
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=75000000
FDCAN1.DataTimeSeg1=13
RCC.FDCANCLockSelection=RCC_FDCANCLKSOURCE_HSE
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Dma.ADC1.0.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.LPUART1Freq_Value=37500000
TIM1.Period=4000
PB13.Mode=FDCAN_Activate
PE6.Locked=true
PD5.Locked=true
SH.ADCx_INP7.ConfNb=1
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
ADC1.EOCSelection=ADC_EOC_SEQ_CONV
FDCAN2.Mode=FDCAN_MODE_NORMAL
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
Dma.ADC1.0.EventEnable=DISABLE
ADC1.Rank-4\#ChannelRegularConversion=5
RCC.VCO3OutputFreq_Value=32250000
PA6.GPIOParameters=GPIO_Label
PCC.Seq0.Step0.Category=Interpolation
PD6.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=ECU.ioc
Dma.ADC1.0.Instance=DMA1_Stream0
RCC.DIVQ2=4
FREERTOS.Tasks01=t_main_task,24,1024,main_task,As weak,NULL,Dynamic,NULL,NULL;t_controle,8,1024,controle,As external,NULL,Dynamic,NULL,NULL;t_datalogger,8,1024,datalogger,As external,NULL,Dynamic,NULL,NULL;t_throttle_read,8,1024,throttle_read,As external,NULL,Dynamic,NULL,NULL;t_steering_read,8,1024,steering_read,As external,NULL,Dynamic,NULL,NULL;t_speed_calc,8,1024,speed_calc,As external,NULL,Dynamic,NULL,NULL;t_odometer_calc,8,1024,odometer_calc,As external,NULL,Dynamic,NULL,NULL;t_thr_handler,8,1024,throttle_handler,As external,NULL,Dynamic,NULL,NULL;t_torque_manager,8,1024,torque_manager,As external,NULL,Dynamic,NULL,NULL;t_debugleds,8,1024,debugleds,As external,NULL,Dynamic,NULL,NULL
ADC1.Rank-0\#ChannelRegularConversion=1
Mcu.PinsNb=41
Dma.ADC1.0.SyncRequestNumber=1
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,OffsetNumber-2\#ChannelRegularConversion,Rank-3\#ChannelRegularConversion,Channel-3\#ChannelRegularConversion,SamplingTime-3\#ChannelRegularConversion,OffsetNumber-3\#ChannelRegularConversion,NbrOfConversion,Rank-4\#ChannelRegularConversion,Channel-4\#ChannelRegularConversion,SamplingTime-4\#ChannelRegularConversion,OffsetNumber-4\#ChannelRegularConversion,Rank-5\#ChannelRegularConversion,Channel-5\#ChannelRegularConversion,SamplingTime-5\#ChannelRegularConversion,OffsetNumber-5\#ChannelRegularConversion,Resolution,ContinuousConvMode,master,ClockPrescaler,ConversionDataManagement,EOCSelection,Overrun
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.SWPMI1Freq_Value=37500000
FREERTOS.configCHECK_FOR_STACK_OVERFLOW=2
PD3.Signal=GPXTI3
PD13.GPIOParameters=GPIO_Label
PD7.Signal=SPI1_MOSI
RCC.DIVP2=4
PCC.Line=STM32H743/753
FDCAN2.TxBuffersNbr=0
RCC.QSPIFreq_Value=75000000
NVIC.FDCAN2_IT0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
FDCAN2.NominalTimeSeg1=5
RCC.D1CPREFreq_Value=75000000
FDCAN2.NominalTimeSeg2=2
SH.GPXTI6.ConfNb=1
PB8.GPIO_Label=BOOT1
RCC.USART234578Freq_Value=37500000
PCC.MCU=STM32H743VITx
RCC.Tim1OutputFreq_Value=75000000
RCC.SPI123Freq_Value=75000000
Dma.ADC1.0.SignalID=NONE
Dma.ADC1.0.Priority=DMA_PRIORITY_LOW
PA9.Signal=LPUART1_TX
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
RCC.DIVN2=20
RCC.DIVN1=18
PB5.Locked=true
FDCAN2.NominalPrescaler=1
SH.ADCx_INP8.0=ADC1_INP8,IN8-Single-Ended
SH.ADCx_INP5.ConfNb=1
PA5.Signal=ADCx_INP19
Mcu.Pin40=VP_TIM2_VS_ClockSourceINT
PE13.GPIOParameters=GPIO_Label
ProjectManager.LastFirmware=true
NVIC.TIM3_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
RCC.AHB12Freq_Value=75000000
PE14.Signal=GPXTI14
PE15.Signal=GPXTI15
PCC.Seq0.Step0.Vcore=VOS1\: Scale1-High
Mcu.Pin37=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin38=VP_SYS_VS_tim3
Mcu.Pin35=PB5
Mcu.Pin36=PB8
SPI1.Mode=SPI_MODE_MASTER
PCC.Seq0.Step0.SubMode3=DRUN
PCC.Seq0.Step0.SubMode2=DRUN
Mcu.Pin39=VP_TIM1_VS_ClockSourceINT
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PD5
PCC.Seq0.Step0.SubMode1=DRUN/CRUN
Mcu.Pin33=PB3 (JTDO/TRACESWO)
Mcu.Pin34=PB4 (NJTRST)
Mcu.Pin31=PD6
Mcu.Pin32=PD7
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
TIM2.Period=0xFFFFFFFF
PB4\ (NJTRST).Mode=Full_Duplex_Master
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=75000000
Mcu.Pin26=PA13 (JTMS/SWDIO)
Mcu.Pin27=PA14 (JTCK/SWCLK)
Mcu.Pin24=PA11
ProjectManager.UnderRoot=true
PE13.Locked=true
Mcu.Pin25=PA12
SH.ADCx_INP7.0=ADC1_INP7,IN7-Single-Ended
Mcu.Pin28=PD3
Mcu.Pin29=PD4
FDCAN1.DataPrescaler=1
PD14.GPIOParameters=GPIO_Label
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
FDCAN1.NominalSyncJumpWidth=2
PB5.Signal=GPIO_Output
Mcu.Pin22=PA9
Mcu.Pin23=PA10
Mcu.Pin20=PC9
ADC1.master=1
PE13.GPIO_Label=S_VEL2
Mcu.Pin21=PA8
PA5.GPIO_Label=S_APPS2
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PE5.GPIO_Label=C_LED_DEBUG2
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=2
Dma.ADC1.0.RequestNumber=1
PA11.Signal=FDCAN1_RX
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB12
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PB13
Mcu.Pin13=PE14
Mcu.Pin14=PE15
Mcu.Pin19=PD14
ADC1.SamplingTime-5\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
SH.GPXTI15.ConfNb=1
RCC.LPTIM345Freq_Value=75000000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD12
Mcu.Pin18=PD13
FREERTOS.Mutexes01=m_state_parameter_mutex,Dynamic,NULL
RCC.LTDCFreq_Value=16125000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
FDCAN2.TxFifoQueueElmtsNbr=4
Mcu.Pin11=PE12
Mcu.Pin12=PE13
PB3\ (JTDO/TRACESWO).Mode=Full_Duplex_Master
Mcu.Pin10=PB1
ADC1.ConversionDataManagement=ADC_CONVERSIONDATA_DMA_CIRCULAR
SH.ADCx_INP19.0=ADC1_INP19,IN19-Single-Ended
PE4.PinState=GPIO_PIN_SET
PA8.Mode=I2C
PE12.GPIOParameters=GPIO_Label
RCC.HCLK3ClockFreq_Value=75000000
PCC.Seq0=1
PA7.GPIOParameters=GPIO_Label
ADC1.Rank-5\#ChannelRegularConversion=6
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
Mcu.Family=STM32H7
FDCAN2.DataSyncJumpWidth=3
RCC.DIVQ2Freq_Value=40000000
ProjectManager.MainLocation=Core/Src
RCC.SAI1Freq_Value=75000000
RCC.CortexFreq_Value=75000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H743VITx
ADC1.Overrun=ADC_OVR_DATA_OVERWRITTEN
ADC1.ContinuousConvMode=ENABLE
FDCAN1.DataSyncJumpWidth=2
PCC.Seq0.Step0.CPU_Frequency=72000000 Hz
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
Dma.ADC1.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PCC.Seq0.Step0.User's_Consumption=0 mA
PC5.Locked=true
ADC1.OffsetNumber-4\#ChannelRegularConversion=ADC_OFFSET_NONE
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-true,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_FDCAN1_Init-FDCAN1-false-HAL-true,6-MX_FDCAN2_Init-FDCAN2-false-HAL-true,7-MX_LPUART1_UART_Init-LPUART1-false-HAL-true,8-MX_SPI1_Init-SPI1-false-HAL-true,9-MX_TIM1_Init-TIM1-false-HAL-true,10-MX_I2C3_Init-I2C3-false-HAL-true,11-MX_TIM2_Init-TIM2-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA11.Mode=FDCAN_Activate
PD6.Locked=true
RCC.PLL2FRACN=0
RCC.VCO2OutputFreq_Value=160000000
NVIC.FDCAN2_IT1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PE5.GPIOParameters=PinState,GPIO_Label
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
RCC.VCOInput3Freq_Value=250000
PD13.Signal=GPIO_Output
Mcu.IP4=FDCAN1
Mcu.IP5=FDCAN2
Mcu.IP2=DEBUG
PD13.Locked=true
Mcu.IP3=DMA
Mcu.IP0=ADC1
Mcu.IP1=CORTEX_M7
PA12.Signal=FDCAN1_TX
PE4.GPIOParameters=PinState,GPIO_Label
TIM1.Prescaler=1799
Mcu.UserConstants=
FDCAN2.FrameFormat=FDCAN_FRAME_CLASSIC
RCC.DIVP3Freq_Value=16125000
RCC.SDMMCFreq_Value=75000000
SH.GPXTI13.ConfNb=1
Mcu.ThirdPartyNb=0
ADC1.Channel-3\#ChannelRegularConversion=ADC_CHANNEL_7
FREERTOS.configUSE_STATS_FORMATTING_FUNCTIONS=1
RCC.HCLKFreq_Value=75000000
Mcu.IPNb=15
ADC1.Resolution=ADC_RESOLUTION_12B_OPT
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.SPDIFRXFreq_Value=75000000
FREERTOS.configUSE_MALLOC_FAILED_HOOK=1
Mcu.Pin6=PA6
Mcu.Pin7=PA7
Mcu.Pin8=PC4
Mcu.Pin9=PC5
FREERTOS.IPParameters=Tasks01,configMINIMAL_STACK_SIZE,FootprintOK,Queues01,configMAX_TASK_NAME_LEN,Mutexes01,configENABLE_FPU,configTOTAL_HEAP_SIZE,configUSE_MALLOC_FAILED_HOOK,configUSE_STATS_FORMATTING_FUNCTIONS,configCHECK_FOR_STACK_OVERFLOW
Mcu.Pin0=PE4
Mcu.Pin1=PE5
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE6
RCC.HRTIMFreq_Value=75000000
Mcu.Pin3=PH0-OSC_IN (PH0)
Mcu.Pin4=PH1-OSC_OUT (PH1)
Mcu.Pin5=PA5
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_3
I2C3.IPParameters=Timing
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
RCC.DIVR3Freq_Value=16125000
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=RCC
PCC.Seq0.Step0.DMIPS=154.08
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
Mcu.IP12=SYS
Mcu.IP11=SPI1
ADC1.SamplingTime-4\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
FDCAN2.ExtFiltersNbr=0
ADC1.Rank-2\#ChannelRegularConversion=3
RCC.DIVP1Freq_Value=75000000
Mcu.IP14=TIM2
Mcu.IP13=TIM1
PE13.Signal=GPXTI13
VP_SYS_VS_tim3.Signal=SYS_VS_tim3
File.Version=6
PB8.Locked=true
PE4.Signal=GPIO_Output
PE6.GPIOParameters=PinState,GPIO_Label
Dma.RequestsNb=1
NVIC.FDCAN1_IT1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
FREERTOS.configTOTAL_HEAP_SIZE=60360
FDCAN1.NominalTimeSeg2=2
FDCAN1.NominalTimeSeg1=13
ProjectManager.ProjectName=ECU
RCC.APB3Freq_Value=37500000
PCC.Seq0.Step0.Oscillator=HSE BYP PLL Flash-LP Cache-ON
PD13.GPIO_Label=C_LED_GREEN
PA6.Signal=ADCx_INP3
PB12.Mode=FDCAN_Activate
RCC.D1PPRE=RCC_APB3_DIV2
PD5.GPIO_Label=B_RTD
FDCAN1.RxFifo0ElmtsNbr=0
ProjectManager.ToolChainLocation=
PD14.Locked=true
SH.GPXTI5.ConfNb=1
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.DIVR1Freq_Value=75000000
PCC.Checker=true
PCC.Seq0.Step0.Duration=1 s
I2C3.Timing=0x00909FCE
PB5.GPIO_Label=C_RTDS
NVIC.DMA1_Stream0_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PCC.Seq0.Step0.Peripherals=Bridge_APB3 WWDG1 ADC1 Bridge_AHB1 Bridge_APB1 Bridge_APB2 FDCAN1 FDCAN2 I2C3 SPI1 TIM1 Bridge_AHB4 Bridge_APB4 GPIOA GPIOB GPIOC GPIOD GPIOE GPIOH LPUART1 SYS
PC5.Signal=ADCx_INP8
PD3.GPIO_Label=B_DEBUG2
FREERTOS.configMAX_TASK_NAME_LEN=32
PD6.Signal=GPXTI6
Dma.Request0=ADC1
FDCAN2.StdFiltersNbr=0
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
PE12.Locked=true
RCC.Tim2OutputFreq_Value=75000000
RCC.DFSDMACLkFreq_Value=75000000
FDCAN2.RxFifo1ElmtsNbr=0
NVIC.FDCAN1_IT0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
SH.GPXTI5.0=GPIO_EXTI5
PB8.GPIOParameters=GPIO_Label
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
PE14.GPIOParameters=GPIO_Label
ADC1.Channel-4\#ChannelRegularConversion=ADC_CHANNEL_8
PA10.Mode=Asynchronous
PCC.Seq0.Step0.Average_Current=31.92 mA
PCC.Vdd=3.0
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
NVIC.SavedSvcallIrqHandlerGenerated=true
ADC1.OffsetNumber-3\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.SAI4BFreq_Value=75000000
PC4.Signal=ADCx_INP4
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=S_VEL3
PD5.Signal=GPXTI5
ProjectManager.DeletePrevious=true
FDCAN1.IPParameters=NominalSyncJumpWidth,NominalTimeSeg1,NominalTimeSeg2,DataSyncJumpWidth,DataTimeSeg1,DataTimeSeg2,RxFifo0ElmtsNbr,RxFifo1ElmtsNbr,RxBuffersNbr,TxEventsNbr,TxBuffersNbr,TxFifoQueueElmtsNbr,NominalPrescaler,DataPrescaler,MessageRAMOffset
FDCAN1.MessageRAMOffset=1280
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PE15.GPIOParameters=GPIO_Label
PD12.Locked=true
RCC.SPI6Freq_Value=75000000
SH.GPXTI6.0=GPIO_EXTI6
FDCAN2.MessageRAMOffset=0
PCC.Seq0.Step0.TaMax=120.69
Dma.ADC1.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PA9.Mode=Asynchronous
VP_SYS_VS_tim3.Mode=TIM3
RCC.SPI45Freq_Value=75000000
PE15.GPIO_Label=S_VEL4
PD12.GPIOParameters=GPIO_Label
PB3\ (JTDO/TRACESWO).Signal=SPI1_SCK
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.VCO1OutputFreq_Value=150000000
Dma.ADC1.0.Mode=DMA_CIRCULAR
PCC.Seq0.Step0.Mode=RUN
Dma.ADC1.0.SyncSignalID=NONE
PC5.GPIOParameters=GPIO_Label
FDCAN2.DataTimeSeg1=4
RCC.AXIClockFreq_Value=75000000
FDCAN2.DataTimeSeg2=3
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_4
SH.GPXTI12.ConfNb=1
PE4.Locked=true
ProjectManager.RegisterCallBack=FDCAN
RCC.USBFreq_Value=75000000
PD3.Locked=true
RCC.CKPERFreq_Value=64000000
NVIC.TIM1_TRG_COM_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
board=custom
PCC.Temperature=25
SH.GPXTI3.0=GPIO_EXTI3
RCC.VCOInput1Freq_Value=8000000
Dma.ADC1.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.ADC1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
FDCAN2.IPParameters=NominalSyncJumpWidth,NominalTimeSeg1,DataSyncJumpWidth,DataTimeSeg1,DataTimeSeg2,RxFifo0ElmtsNbr,RxFifo1ElmtsNbr,RxBuffersNbr,TxEventsNbr,TxBuffersNbr,TxFifoQueueElmtsNbr,NominalPrescaler,DataPrescaler,FrameFormat,Mode,AutoRetransmission,NominalTimeSeg2,MessageRAMOffset,StdFiltersNbr,ExtFiltersNbr
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=75000000
PCC.Seq0.Step0.Frequency=25 MHz
FDCAN1.RxFifo1ElmtsNbr=0
MxCube.Version=6.2.1
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PD4.GPIO_Label=B_DEBUG1
RCC.FDCANFreq_Value=8000000
RCC.ADCFreq_Value=40000000
PD4.GPIOParameters=GPIO_Label
FDCAN1.TxEventsNbr=0
PD14.GPIO_Label=C_LED_RED
PE5.Locked=true
PE6.Signal=GPIO_Output
ADC1.NbrOfConversion=6
ADC1.OffsetNumber-2\#ChannelRegularConversion=ADC_OFFSET_NONE
