Tesla-UFMG/ECU/ECU.ioc
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANCLockSelection,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H743VITx
PE12.Signal=GPXTI12
NVIC.SavedPendsvIrqHandlerGenerated=true
Mcu.IP8=LPUART1
SH.ADCx_INP8.ConfNb=1
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=NVIC
PD14.Signal=GPIO_Output
Mcu.IP6=FREERTOS
Mcu.IP7=I2C3
ProjectManager.CoupleFile=false
PCC.Seq0.Step0.Memory=SRAM1
RCC.SYSCLKFreq_VALUE=75000000
RCC.I2C123Freq_Value=37500000
PA7.GPIO_Label=S_FREIO
PA12.Mode=FDCAN_Activate
SH.GPXTI4.0=GPIO_EXTI4
ADC1.Rank-3\#ChannelRegularConversion=4
ADC1.SamplingTime-3\#ChannelRegularConversion=ADC_SAMPLETIME_810CYCLES_5
KeepUserPlacement=false
PC5.GPIO_Label=S_ADC_E1
SH.ADCx_INP19.ConfNb=1
FDCAN2.AutoRetransmission=DISABLE
Dma.ADC1.0.SyncEnable=DISABLE
NVIC.EXTI9_5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Dma.ADC1.0.MemInc=DMA_MINC_ENABLE
SH.GPXTI4.ConfNb=1
RCC.SAI4AFreq_Value=75000000
FDCAN2.RxBuffersNbr=0
ADC1.NbrOfConversionFlag=1
SH.GPXTI15.0=GPIO_EXTI15
RCC.DIVQ1Freq_Value=75000000
PB8.Signal=GPIO_Input
PC9.Signal=I2C3_SDA
SH.ADCx_INP3.ConfNb=1
PCC.Seq0.Step0.Vdd=3.0
RCC.VCOInput2Freq_Value=8000000
RCC.APB1Freq_Value=37500000
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV2
FDCAN1.TxFifoQueueElmtsNbr=4
ProjectManager.DeviceId=STM32H743VITx
PB12.Signal=FDCAN2_RX
ProjectManager.LibraryCopy=1
PB1.GPIOParameters=GPIO_Label
PA7.Signal=ADCx_INP7
PB4\ (NJTRST).Signal=SPI1_MISO
isbadioc=false
